## Problem 1

### Import the library pandas as pd

#### Import արեք pandas գրադարանը pd  անունով

In [160]:
import pandas as pd

### Import the dataset gender.txt, assign to a variable gender and use user_id as index

### Import արեք gender.txt dataset-ը, վերագրեք այն gender փոփոխականին ու օգտագործեք  user_id սյունը որպես index

In [161]:
gender = pd.read_csv("data/gender.txt", sep = "|")

### Print the first 20 entries

### Տպեք առաջին 20 արժեքները

In [162]:
gender.head(20)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660

### Print the last 10 entries

### Տպեք վերջին 10 արժեքները

In [163]:
gender.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### What is the number of rows in the dataset?

### Քանի տող կա dataset-ում?

In [164]:
len(gender)

943

### What is the number of columns in the dataset?

### Քանի սյուն կա dataset-ում?

In [165]:
len(gender.columns)

5

### Print the name of all the columns

### Տպեք սյուների անունները

In [166]:
gender.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### How is the dataset indexed?

### Ինչպես է ինդեքսավորված dataset-ը?

In [167]:
gender.index

RangeIndex(start=0, stop=943, step=1)

### What is the data type of each column?

### Ինչ տիպի է ամեն սյունը՞

In [168]:
gender.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### Print only the occupation column

### Տպեք միայն occupation սյունը

In [169]:
gender.occupation

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### How many different occupations there are in this dataset?

### * Քանի հատ տարբեր occupation կա dataset-ում?

In [170]:
len(gender.occupation.drop_duplicates())

21

### What is the most frequent occupation?

### Որն է ամենահաճախ հանդիպող occupation-ը?

In [171]:
gender.occupation.mode()

0    student
dtype: object

## Problem 2

### Import the libraries

### Import արեք pandas գրադարանը pd անունով

In [172]:
import pandas as pd

### Import the dataset drinks.csv, assign it to a variable called drinks

### Import արեք drinks.csv dataset-ը, վերագրեք այն drinks փոփոխականին

In [196]:
drinks = pd.read_csv("data/drinks.csv")

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### Which continent drinks more beer on average?

### Որ continent-ն է միջինում ավելի շատ գարեջուր խմում՞

In [176]:
drinks.groupby('continent')['beer_servings'].sum().head(1)

continent
AF    3258
Name: beer_servings, dtype: int64

### For each continent print the statistics for wine consumption

### Ամեն continent-ի համար տպեք wine_servings-ի ստատիստիկան (mean, min, max, std, quartiles)

In [177]:
drinks.groupby("continent")["wine_servings"].agg(["mean", "min", "max", "std", "quantile"])

                 mean  min  max        std  quantile
continent
AF          16.264151    0  233  38.846419       2.0
AS           9.068182    0  123  21.667034       1.0
EU         142.222222    0  370  97.421738     128.0
OC          35.625000    0  212  64.555790       8.5
SA          62.416667    1  221  88.620189      12.0

### Print the mean alcohol consumption per continent for every column

### Ամեն սյան համար տպեք միջին ալկոհոլի օգտագործման քանակը ամեն continent-ի համար

In [178]:
drinks.groupby("continent")[["total_litres_of_pure_alcohol"]].mean()

           total_litres_of_pure_alcohol
continent
AF                             3.007547
AS                             2.170455
EU                             8.617778
OC                             3.381250
SA                             6.308333

### Print the median alcohol consumption per continent for every column

### Ամեն սյան համար տպեք մեդիան ալկոհոլի օգտագործման քանակը ամեն continent-ի համար

In [93]:
drinks.groupby("continent")["total_litres_of_pure_alcohol"].median()

continent
AF     2.30
AS     1.20
EU    10.00
OC     1.75
SA     6.85
Name: total_litres_of_pure_alcohol, dtype: float64

### Print the mean, min and max values for spirt consumption. 

### Տպեք spirt-ի օգտագործման mean, min ու max-ը։

In [197]:
drinks.groupby("continent")["spirit_servings"].agg(["mean", "min", "max"])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

## Problem 3

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [180]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [181]:
baby_names = pd.read_csv('data/baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [182]:
 baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [183]:
baby_names.drop(["Unnamed: 0", "Id"], axis = 1, inplace = True)

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [184]:
female_more_than_male = len(baby_names[baby_names["Gender"] == "F"]) > len(baby_names[baby_names["Gender"] == "M"])
female_more_than_male

True

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [185]:
baby_names.drop(["Year"], axis = 1, inplace = True)
names = baby_names.groupby("Name")

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [186]:
len(names)

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [188]:
names["Count"].sum().sort_values(ascending = False).head(1)

Name
Emma    561
Name: Count, dtype: int64

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [192]:
baby_names[baby_names["Count"] == baby_names["Count"].median()]

           Name Gender State  Count
93       Aubrey      F    AK      8
94    Charlotte      F    AK      8
95    Christina      F    AK      8
96        Clara      F    AK      8
97      Delaney      F    AK      8
...         ...    ...   ...    ...
2291      Laura      F    AK      8
2292      Lydia      F    AK      8
2293   Mckinley      F    AK      8
2294       Rory      F    AK      8
2295     Winter      F    AK      8

[227 rows x 4 columns]

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [195]:
baby_names.describe()

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000